trefeon/excavator-rental-timer/firmware/wifi_master_esp32_WEBUI/main.cpp
/*
 * Excavator Rental Timer - Wi-Fi Master (ESP-NOW Gateway)
 * 
 * Architecture:
 * - Acts as an Access Point (SSID: ExcavatorMaster) for Android App
 * - Uses ESP-NOW to communicate with Slave devices (no Wi-Fi connection needed)
 * - Android App connects via Wi-Fi and uses HTTP API (unchanged)
 * - Master translates HTTP commands to ESP-NOW packets for slaves
 * - Registry logic (MAC -> ID mapping) stored in Preferences
 * - DNSServer captive portal keeps Android Wi-Fi connection stable
 */

#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <Preferences.h>
#include <SPIFFS.h>
#include <ArduinoJson.h>
#include <DNSServer.h>
#include "index_html.h"

#include <esp_idf_version.h>
#include <freertos/semphr.h>
#include <freertos/queue.h>
#include <esp_task_wdt.h>
#include <esp_wifi.h>
#include <esp_now.h>

#include "esp_now_protocol.h"

// ===== CONFIG =====
#define DEMO_MODE 0
static const char* AP_SSID = "ExcavatorMaster";
static const char* AP_PASS = "12345678";

WebServer server(80);
Preferences preferences;
SemaphoreHandle_t slavesMutex = NULL;
// Mutex khusus untuk melindungi baca-tulis /stats.json di SPIFFS.
// Tanpa ini, autoSaveStats/saveElapsedOnly (dipanggil dari loop ESP-NOW)
// bisa berbarengan dengan handleAddStats/handleResetStats (dipanggil dari
// HTTP handler) saling timpa file karena pola read-modify-write-nya tidak atomik.
// Akibatnya: reset salah satu RC bisa "menimpa balik" stats RC lain dengan
// data basi (stale), termasuk mengembalikan/menambah totalSesi RC lain.
SemaphoreHandle_t statsMutex = NULL;
static const uint32_t STATS_MUTEX_TIMEOUT_TICKS = pdMS_TO_TICKS(500);

// ===== TIMING =====
static const uint32_t ONLINE_THRESHOLD_MS = 30000;
static const uint32_t MUTEX_TIMEOUT_TICKS = pdMS_TO_TICKS(500);
static const uint32_t CMD_RESPONSE_TIMEOUT_MS = 500;

// ===== DNS =====
const byte DNS_PORT = 53;
DNSServer dnsServer;

// ===== LED =====
#define LED_PIN 2

void addCorsHeaders();
void handleOptions();

uint32_t ledOffTime = 0;

void netLedFlash(int ms = 50) {
  digitalWrite(LED_PIN, HIGH);  // ON (Standard ESP32 is Active High)
  ledOffTime = millis() + ms;
}

void updateLed() {
  if (ledOffTime > 0 && millis() >= ledOffTime) {
    digitalWrite(LED_PIN, LOW); // OFF
    ledOffTime = 0;
  }
}

// ===== SLAVE REGISTRY =====
struct SlaveRecord {
  String mac;
  int id;
  String ip;           // empty for ESP-NOW slaves, kept for API compatibility
  uint32_t lastSeen;
  String state;        // "RUNNING", "LOCKED", "PAUSED", "ENDED"
  String prevState;    // state sebelumnya, untuk deteksi transisi ke ENDED
  int time_left;
  int sessionElapsed;  // detik yang sudah berjalan di sesi ini (untuk auto-save)
  bool stoppedManually; // true = di-STOP manual, polling ENDED tidak perlu autoSaveStats lagi
  String battery;
  uint8_t rawMac[6];   // raw MAC bytes for ESP-NOW addressing
};
SlaveRecord slaves[50];
int slaveCount = 0;

// ===== COMMAND RESPONSE SYNCHRONIZATION =====
// Used to wait for a slave's ESP-NOW response after sending a command
SemaphoreHandle_t cmdResponseSem = NULL;
volatile bool cmdResponseReceived = false;
EspNowPacket cmdResponsePkt;
portMUX_TYPE cmdResponseMux = portMUX_INITIALIZER_UNLOCKED;

// ===== DEFERRED STATS PERSISTENCE =====
// ESP-NOW receive callback berjalan di WiFi task dan TIDAK boleh melakukan
// operasi flash yang lama (SPIFFS/NVS). Maka penyimpanan stats saat transisi
// ENDED tidak ditulis langsung di callback, melainkan dimasukkan ke antrian
// dan diproses di loop() (task context) agar callback tetap singkat.
struct StatsJob {
  int  slaveId;
  int  detik;
  bool incrementSesi; // true = sesi selesai alami (totalDetik + totalSesi)
};
QueueHandle_t statsQueue = NULL;

// ===== AUTH RATE-LIMIT (mitigasi brute force) =====
// Mencegah percakapan gagal login / verify-sa berulang tanpa batas.
static uint8_t  authFailCount = 0;
static uint32_t authLockUntil = 0;
static const uint8_t  AUTH_FAIL_MAX = 5;
static const uint32_t AUTH_LOCK_MS  = 30000;
bool authIsLocked() { return authLockUntil != 0 && (int32_t)(millis() - authLockUntil) < 0; }
void authNoteFail() {
  if (++authFailCount >= AUTH_FAIL_MAX) { authLockUntil = millis() + AUTH_LOCK_MS; authFailCount = 0; }
}
void authNoteSuccess() { authFailCount = 0; authLockUntil = 0; }

// ===== HELPERS =====
void addCorsHeaders() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "Content-Type, X-Admin-User, X-Admin-Pass");
}

void handleOptions() {
  addCorsHeaders();
  server.send(204);
}

String getMacKey(const String& m) {
  String k = m;
  k.replace(":", "");
  return k;
}

String macToString(const uint8_t* mac) {
  char buf[18];
  snprintf(buf, sizeof(buf), "%02X:%02X:%02X:%02X:%02X:%02X",
           mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  return String(buf);
}

bool isValidMac(const String& mac) {
  if (mac.length() != 17) return false;
  for (int i = 0; i < 17; i++) {
    char c = mac.charAt(i);
    if (i % 3 == 2) {
      if (c != ':') return false;
    } else {
      if (!((c >= '0' && c <= '9') || (c >= 'A' && c <= 'F') || (c >= 'a' && c <= 'f'))) return false;
    }
  }
  return true;
}

// ===== REGISTRY LOGIC =====
// Assigns an ID for a given MAC address. Returns the assigned ID (or 0 if full).
int assignIdForMac(const String& mac) {
  int assignedId = 0;

  // Check if already in Preferences
  preferences.begin("registry", false);
  assignedId = preferences.getInt(getMacKey(mac).c_str(), 0);
  preferences.end();

  if (assignedId == 0) {
    // Find next free ID
    preferences.begin("id_map", false);
    for (int i = 1; i <= 50; i++) {
      String existingMac = preferences.getString(String(i).c_str(), "");
      if (existingMac == "") {
        assignedId = i;
        preferences.putString(String(i).c_str(), mac);
        break;
      }
    }
    preferences.end();

    if (assignedId > 0) {
      preferences.begin("registry", false);
      preferences.putInt(getMacKey(mac).c_str(), assignedId);
      preferences.end();
      Serial.printf("[REGISTRY] New Slave registered. MAC: %s assigned ID: EXC-%02d\n", mac.c_str(), assignedId);
    } else {
      Serial.println("[REGISTRY] ERROR: No free IDs available!");
    }
  } else {
    Serial.printf("[REGISTRY] Known Slave returning from Flash. MAC: %s loaded ID: EXC-%02d\n", mac.c_str(), assignedId);
  }

