trefeon/excavator-rental-timer/firmware/wifi_master_esp32_WEBUI/main.cpp
  return assignedId;
}

// Add or update slave in the in-memory array
void upsertSlave(const String& mac, int id, const uint8_t* rawMac) {
  // Check if already exists
  for (int i = 0; i < slaveCount; i++) {
    if (slaves[i].mac == mac) {
      slaves[i].id = id;
      slaves[i].lastSeen = millis();
      memcpy(slaves[i].rawMac, rawMac, 6);
      return;
    }
  }
  // Add new
  if (slaveCount < 50) {
    slaves[slaveCount].mac = mac;
    slaves[slaveCount].id = id;
    slaves[slaveCount].ip = "";  // ESP-NOW slaves don't have IPs
    slaves[slaveCount].lastSeen = millis();
    slaves[slaveCount].state = "LOCKED";
    slaves[slaveCount].prevState = "LOCKED";
    slaves[slaveCount].time_left = 0;
    slaves[slaveCount].sessionElapsed = 0;
    slaves[slaveCount].stoppedManually = false;
    slaves[slaveCount].battery = "OK";
    memcpy(slaves[slaveCount].rawMac, rawMac, 6);
    slaveCount++;
  }
}

// ===== FORWARD DECLARATIONS =====
// Diperlukan karena fungsi-fungsi ini dipanggil di dalam onEspNowRecv
// sebelum didefinisikan di bawah.
JsonDocument loadJsonFile(const char* path);
bool saveJsonFile(const char* path, const JsonDocument& doc);
bool autoSaveStats(int slaveId, int detik);
bool saveElapsedOnly(int slaveId, int detik);

// ===== ESP-NOW RECEIVE CALLBACK =====
// Note: ESP32 standard (IDF v4) uses the old callback signature.
// ESP32-C3 (IDF v5) uses esp_now_recv_info_t. We handle both via macro.
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
void onEspNowRecv(const esp_now_recv_info_t* info, const uint8_t* data, int len) {
  const uint8_t* mac_addr = info->src_addr;
#else
void onEspNowRecv(const uint8_t* mac_addr, const uint8_t* data, int len) {
#endif
  if (len != sizeof(EspNowPacket)) return;

  EspNowPacket pkt;
  memcpy(&pkt, data, sizeof(EspNowPacket));

  String senderMac = macToString(pkt.mac);

  switch (pkt.type) {
    case PKT_REGISTER_REQ: {
      Serial.printf("[ESPNOW] Registration request from MAC: %s\n", senderMac.c_str());

      int assignedId = 0;
      if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
        assignedId = assignIdForMac(senderMac);
        if (assignedId > 0) {
          upsertSlave(senderMac, assignedId, pkt.mac);
        }
        xSemaphoreGive(slavesMutex);
      }

      // Send registration response
      EspNowPacket resp;
      memset(&resp, 0, sizeof(resp));
      resp.type = PKT_REGISTER_RESP;
      resp.targetId = assignedId;
      resp.senderId = 0; // Master
      memcpy(resp.mac, pkt.mac, 6);

      esp_now_send(ESPNOW_BROADCAST, (uint8_t*)&resp, sizeof(resp));
      Serial.printf("[ESPNOW] Sent registration response: ID=%d to %s\n", assignedId, senderMac.c_str());
      break;
    }

    case PKT_HEARTBEAT: {
      if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
        bool found = false;
        for (int i = 0; i < slaveCount; i++) {
          if (slaves[i].mac == senderMac) {
            found = true;
            String newState = pktStateName(pkt.state);

            // Hitung elapsed: jika sebelumnya RUNNING dan time_left berkurang
            if (slaves[i].state == "RUNNING" && newState == "RUNNING") {
              int diff = slaves[i].time_left - (int)pkt.timeLeft;
              if (diff > 0) slaves[i].sessionElapsed += diff;
            }

            // Deteksi transisi ke sesi baru: dari ENDED/LOCKED ke RUNNING
            if ((slaves[i].state == "ENDED" || slaves[i].state == "LOCKED") &&
                newState == "RUNNING") {
              slaves[i].sessionElapsed = 0; // reset counter sesi baru
            }

            // Deteksi transisi ke ENDED → auto-save stats
            // PENTING: callback ESP-NOW berjalan di WiFi task, jadi JANGAN tulis
            // SPIFFS di sini. Cukup masukkan job ke antrian (operasi cepat,
            // non-blocking) lalu reset counter SAMBIL tetap memegang mutex —
            // tidak ada lagi lepas/ambil-ulang mutex di tengah callback.
            // Skip kalau sudah di-STOP manual (sudah disimpan via residual flush).
            if (slaves[i].state != "ENDED" && newState == "ENDED") {
              if (!slaves[i].stoppedManually && statsQueue) {
                StatsJob job = { slaves[i].id, slaves[i].sessionElapsed, true };
                xQueueSend(statsQueue, &job, 0); // sesi selesai alami → increment sesi
              }
              slaves[i].sessionElapsed  = 0;
              slaves[i].stoppedManually = false; // reset flag
            }

            slaves[i].prevState  = slaves[i].state;
            slaves[i].state      = newState;
            slaves[i].time_left  = pkt.timeLeft;
            slaves[i].battery    = "OK";
            slaves[i].lastSeen   = millis();

            // Check if slave's ID is out of sync (e.g., after edit_slave)
            if (pkt.senderId != (uint8_t)slaves[i].id) {
              Serial.printf("[ESPNOW] Slave %s has stale ID %d, correcting to %d\n",
                            senderMac.c_str(), pkt.senderId, slaves[i].id);
              // Send correction
              EspNowPacket corr;
              memset(&corr, 0, sizeof(corr));
              corr.type = PKT_REGISTER_RESP;
              corr.targetId = slaves[i].id;
              memcpy(corr.mac, pkt.mac, 6);
              esp_now_send(ESPNOW_BROADCAST, (uint8_t*)&corr, sizeof(corr));
            }
            break;
          }
        }

        // Unknown MAC sending heartbeats — auto-register from Preferences
        // This handles Master reboot: slave is still heartbeating but Master
        // lost its in-memory array. The Preferences (flash) still has the MAC→ID mapping.
        if (!found) {
          Serial.printf("[ESPNOW] Heartbeat from unknown MAC %s — auto-registering\n", senderMac.c_str());
          int assignedId = assignIdForMac(senderMac);
          if (assignedId > 0) {
            upsertSlave(senderMac, assignedId, pkt.mac);
            // Update state from heartbeat data
            for (int i = 0; i < slaveCount; i++) {
              if (slaves[i].mac == senderMac) {
                slaves[i].state = pktStateName(pkt.state);
                slaves[i].time_left = pkt.timeLeft;
                slaves[i].lastSeen = millis();
                break;
              }
            }
            // Send registration response so slave knows it's recognized
            EspNowPacket resp;
            memset(&resp, 0, sizeof(resp));
            resp.type = PKT_REGISTER_RESP;
            resp.targetId = assignedId;
            memcpy(resp.mac, pkt.mac, 6);
            esp_now_send(ESPNOW_BROADCAST, (uint8_t*)&resp, sizeof(resp));
          }
        }

        xSemaphoreGive(slavesMutex);
      }
      break;
    }

