trefeon/excavator-rental-timer/firmware/wifi_master_esp32_WEBUI/main.cpp
    case PKT_COMMAND_RESP: {
      // Store the response and signal the waiting HTTP handler
      portENTER_CRITICAL(&cmdResponseMux);
      memcpy(&cmdResponsePkt, &pkt, sizeof(pkt));
      cmdResponseReceived = true;
      portEXIT_CRITICAL(&cmdResponseMux);

      if (cmdResponseSem) {
        xSemaphoreGive(cmdResponseSem);
      }

      // Also update the slave cache
      if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
        for (int i = 0; i < slaveCount; i++) {
          if (slaves[i].mac == senderMac) {
            slaves[i].state = pktStateName(pkt.state);
            slaves[i].time_left = pkt.timeLeft;
            slaves[i].lastSeen = millis();
            break;
          }
        }
        xSemaphoreGive(slavesMutex);
      }
      break;
    }

    default:
      Serial.printf("[ESPNOW] Unknown packet type: %d\n", pkt.type);
      break;
  }
}

// ===== AUTO-SAVE STATS =====
// Dipanggil di server-side saat sesi RC selesai (time_left habis atau STOP)
// sehingga total main tersimpan meski browser sedang tutup/offline.
bool autoSaveStats(int slaveId, int detik) {
  if (xSemaphoreTake(statsMutex, STATS_MUTEX_TIMEOUT_TICKS) != pdTRUE) {
    Serial.println("[STATS] autoSaveStats: gagal ambil statsMutex, skip");
    return false;
  }
  JsonDocument stats = loadJsonFile("/stats.json");
  String id = String(slaveId);
  if (stats[id].isNull()) {
    stats[id]["totalDetik"] = 0;
    stats[id]["totalSesi"]  = 0;
  }
  if (detik > 0) {
    stats[id]["totalDetik"] = stats[id]["totalDetik"].as<int>() + detik;
  }
  stats[id]["totalSesi"]  = stats[id]["totalSesi"].as<int>() + 1;
  bool ok = saveJsonFile("/stats.json", stats);
  Serial.printf("[STATS] Auto-save: RC %d +%ds (total=%ds, sesi=%d) ok=%d\n",
                slaveId, detik,
                stats[id]["totalDetik"].as<int>(),
                stats[id]["totalSesi"].as<int>(), ok);
  xSemaphoreGive(statsMutex);
  return ok;
}

// Dipanggil saat STOP manual — hanya simpan totalDetik, TIDAK increment totalSesi
// karena sesi belum selesai secara alami (timer belum habis)
bool saveElapsedOnly(int slaveId, int detik) {
  if (detik <= 0) return true;
  if (xSemaphoreTake(statsMutex, STATS_MUTEX_TIMEOUT_TICKS) != pdTRUE) {
    Serial.println("[STATS] saveElapsedOnly: gagal ambil statsMutex, skip");
    return false;
  }
  JsonDocument stats = loadJsonFile("/stats.json");
  String id = String(slaveId);
  if (stats[id].isNull()) {
    stats[id]["totalDetik"] = 0;
    stats[id]["totalSesi"]  = 0;
  }
  stats[id]["totalDetik"] = stats[id]["totalDetik"].as<int>() + detik;
  // totalSesi TIDAK diubah
  bool ok = saveJsonFile("/stats.json", stats);
  Serial.printf("[STATS] STOP-save: RC %d +%ds (total=%ds, sesi=%d, sesi tidak berubah) ok=%d\n",
                slaveId, detik,
                stats[id]["totalDetik"].as<int>(),
                stats[id]["totalSesi"].as<int>(), ok);
  xSemaphoreGive(statsMutex);
  return ok;
}

// ===== SPIFFS HELPERS =====
JsonDocument loadJsonFile(const char* path) {
  JsonDocument doc;
  File file = SPIFFS.open(path, "r");
  if (!file) return doc;
  deserializeJson(doc, file);
  file.close();
  return doc;
}

bool saveJsonFile(const char* path, const JsonDocument& doc) {
  File file = SPIFFS.open(path, "w");
  if (!file) return false;
  size_t n = serializeJson(doc, file);
  file.close();
  return n > 0;
}

bool authCheck(bool requireSA = false) {
  String u = server.header("X-Admin-User");
  String p = server.header("X-Admin-Pass");
  if (u == "" || p == "") return false;

  JsonDocument auth = loadJsonFile("/auth.json");
  
  if (auth["sa"]["user"] == u && auth["sa"]["pass"] == p) {
    return true; // SuperAdmin has access to everything
  }
  
  if (!requireSA) {
    JsonArray kr = auth["kr"].as<JsonArray>();
    for (JsonObject k : kr) {
      if (k["user"] == u && k["pass"] == p) return true;
    }
  }
  
  return false;
}

// ===== HTTP HANDLERS =====

// GET /api/auth — check if SA exists
void handleCheckAuth() {
  addCorsHeaders();
  JsonDocument auth = loadJsonFile("/auth.json");
  bool exists = !auth["sa"]["user"].isNull();
  server.send(200, "application/json", "{\"exists\":" + String(exists ? "true" : "false") + "}");
}

// POST /api/auth/register — register SA (only if not exists)
void handleRegisterSA() {
  addCorsHeaders();
  if (!server.hasArg("plain")) { server.send(400); return; }
  JsonDocument doc; deserializeJson(doc, server.arg("plain"));
  String u = doc["username"] | "";
  String p = doc["password"] | "";
  if (u == "" || p.length() < 4) { server.send(400, "application/json", "{\"ok\":0}"); return; }

  JsonDocument auth = loadJsonFile("/auth.json");
  if (!auth["sa"]["user"].isNull()) {
    server.send(400, "application/json", "{\"ok\":0,\"code\":\"ALREADY_EXISTS\"}"); return;
  }

  auth["sa"]["user"] = u;
  auth["sa"]["pass"] = p;
  if (auth["kr"].isNull()) auth["kr"] = JsonArray();
  saveJsonFile("/auth.json", auth);
  server.send(200, "application/json", "{\"ok\":1}");
}

// POST /api/auth/login — return role
void handleLogin() {
  addCorsHeaders();
  if (authIsLocked()) { server.send(429, "application/json", "{\"ok\":0,\"code\":\"LOCKED\"}"); return; }
  if (!server.hasArg("plain")) { server.send(400); return; }
  JsonDocument doc; deserializeJson(doc, server.arg("plain"));
  String u = doc["username"] | "";
  String p = doc["password"] | "";

  JsonDocument auth = loadJsonFile("/auth.json");
  bool userExists = false;

  if (!auth["sa"]["user"].isNull() && auth["sa"]["user"] == u) {
    userExists = true;
    if (auth["sa"]["pass"] == p) {
      authNoteSuccess();
      server.send(200, "application/json", "{\"ok\":1,\"role\":\"sa\"}"); return;
    }
  } else {
    JsonArray kr = auth["kr"].as<JsonArray>();
    for (JsonObject k : kr) {
      if (k["user"] == u) {
        userExists = true;
        if (k["pass"] == p) {
          authNoteSuccess();
          server.send(200, "application/json", "{\"ok\":1,\"role\":\"kr\"}"); return;
        }
        break;
      }
    }
  }

  authNoteFail();
  if (!userExists) {
    server.send(400, "application/json", "{\"ok\":0,\"code\":\"USER_NOT_FOUND\"}");
  } else {
    server.send(400, "application/json", "{\"ok\":0,\"code\":\"WRONG_PASSWORD\"}");
  }
}

