trefeon/excavator-rental-timer/firmware/wifi_master_esp32_WEBUI/main.cpp
// POST /api/auth/verify-sa — cek HANYA password SuperAdmin (tanpa perlu username)
// Dipakai saat karyawan ingin melakukan aksi yang butuh otorisasi SA (contoh:
// reset total main) tapi sedang login sebagai karyawan. Karena hanya ada satu
// akun SA per device, cukup cocokkan password terhadap auth["sa"]["pass"].
// Endpoint ini sengaja TIDAK memerlukan header X-Admin-User/X-Admin-Pass agar
// karyawan yang sedang login tetap bisa memverifikasi password SA.
void handleVerifySA() {
  addCorsHeaders();
  if (authIsLocked()) { server.send(429, "application/json", "{\"ok\":0,\"code\":\"LOCKED\"}"); return; }
  if (!server.hasArg("plain")) { server.send(400); return; }
  JsonDocument doc; deserializeJson(doc, server.arg("plain"));
  String p = doc["password"] | "";

  JsonDocument auth = loadJsonFile("/auth.json");
  if (auth["sa"]["user"].isNull()) {
    server.send(400, "application/json", "{\"ok\":0,\"code\":\"NO_SA\"}"); return;
  }
  if (auth["sa"]["pass"] == p) {
    authNoteSuccess();
    // Kembalikan juga username SA agar frontend bisa memakainya sebagai
    // kredensial X-Admin-User pada request berikutnya (mis. reset total main).
    String saUser = auth["sa"]["user"].as<String>();
    String out = "{\"ok\":1,\"saUser\":\"" + saUser + "\"}";
    server.send(200, "application/json", out); return;
  }
  authNoteFail();
  server.send(400, "application/json", "{\"ok\":0}");
}


// POST /api/auth/change-pass
void handleChangePass() {
  addCorsHeaders();
  if (!authCheck()) { server.send(401); return; }
  if (!server.hasArg("plain")) { server.send(400); return; }
  JsonDocument doc; deserializeJson(doc, server.arg("plain"));
  String u = doc["username"] | "";
  String oldP = doc["oldPass"] | "";
  String newP = doc["newPass"] | "";

  JsonDocument auth = loadJsonFile("/auth.json");
  if (auth["sa"]["user"] == u && auth["sa"]["pass"] == oldP) {
    auth["sa"]["pass"] = newP;
    saveJsonFile("/auth.json", auth);
    server.send(200, "application/json", "{\"ok\":1}"); return;
  }

  JsonArray kr = auth["kr"].as<JsonArray>();
  for (JsonObject k : kr) {
    if (k["user"] == u && k["pass"] == oldP) {
      k["pass"] = newP;
      saveJsonFile("/auth.json", auth);
      server.send(200, "application/json", "{\"ok\":1}"); return;
    }
  }
  server.send(400, "application/json", "{\"ok\":0}");
}

// GET /api/karyawan
void handleGetKaryawan() {
  addCorsHeaders();
  if (!authCheck(true)) { server.send(401); return; } // SA only
  JsonDocument auth = loadJsonFile("/auth.json");
  JsonDocument res;
  JsonArray resArr = res["karyawan"].to<JsonArray>();
  JsonArray kr = auth["kr"].as<JsonArray>();
  for (JsonObject k : kr) {
    resArr.add(k["user"]);
  }
  String out; serializeJson(res, out);
  server.send(200, "application/json", out);
}

// POST /api/karyawan/add
void handleAddKaryawan() {
  addCorsHeaders();
  if (!authCheck(true)) { server.send(401); return; } // SA only
  if (!server.hasArg("plain")) { server.send(400); return; }
  JsonDocument doc; deserializeJson(doc, server.arg("plain"));
  String u = doc["username"] | "";
  String p = doc["password"] | "";
  if (u == "" || p.length() < 4) { server.send(400, "application/json", "{\"ok\":0}"); return; }

  JsonDocument auth = loadJsonFile("/auth.json");
  if (auth["sa"]["user"] == u) { server.send(400, "application/json", "{\"ok\":0,\"code\":\"ALREADY_EXISTS\"}"); return; }
  
  JsonArray kr = auth["kr"].as<JsonArray>();
  if (!kr) kr = auth["kr"].to<JsonArray>();
  for (JsonObject k : kr) {
    if (k["user"] == u) { server.send(400, "application/json", "{\"ok\":0,\"code\":\"ALREADY_EXISTS\"}"); return; }
  }

  JsonObject newKr = kr.add<JsonObject>();
  newKr["user"] = u;
  newKr["pass"] = p;
  saveJsonFile("/auth.json", auth);
  server.send(200, "application/json", "{\"ok\":1}");
}

// POST /api/karyawan/delete
void handleDeleteKaryawan() {
  addCorsHeaders();
  if (!authCheck(true)) { server.send(401); return; } // SA only
  if (!server.hasArg("plain")) { server.send(400); return; }
  JsonDocument doc; deserializeJson(doc, server.arg("plain"));
  String u = doc["username"] | "";

  JsonDocument auth = loadJsonFile("/auth.json");
  JsonArray kr = auth["kr"].as<JsonArray>();
  for (int i = 0; i < kr.size(); i++) {
    if (kr[i]["user"] == u) {
      kr.remove(i);
      saveJsonFile("/auth.json", auth);
      server.send(200, "application/json", "{\"ok\":1}"); return;
    }
  }
  server.send(400, "application/json", "{\"ok\":0}");
}

// GET /api/stats
void handleGetStats() {
  addCorsHeaders();
  if (!authCheck(false)) { server.send(401); return; }
  if (xSemaphoreTake(statsMutex, STATS_MUTEX_TIMEOUT_TICKS) != pdTRUE) {
    server.send(503, "application/json", "{\"ok\":0,\"err\":\"busy\"}"); return;
  }
  JsonDocument stats = loadJsonFile("/stats.json");
  String out; serializeJson(stats, out);
  xSemaphoreGive(statsMutex);
  server.send(200, "application/json", out);
}

// POST /api/stats/add
// Body: { id, detik, sesi? }
//   sesi omitted / 1  → tambah totalDetik + totalSesi  (sesi selesai alami)
//   sesi = 0          → tambah totalDetik saja          (STOP manual, sesi belum selesai)
void handleAddStats() {
  addCorsHeaders();
  if (!authCheck(false)) { server.send(401); return; }
  if (!server.hasArg("plain")) { server.send(400); return; }
  JsonDocument doc; deserializeJson(doc, server.arg("plain"));
  String id   = doc["id"].as<String>();
  int detik   = doc["detik"] | 0;
  // sesi: default 1 (increment), kirim 0 dari HTML saat STOP manual
  int sesi    = doc["sesi"] | 1;
  if (id == "" || detik <= 0) { server.send(400, "application/json", "{\"ok\":0}"); return; }

  if (xSemaphoreTake(statsMutex, STATS_MUTEX_TIMEOUT_TICKS) != pdTRUE) {
    server.send(503, "application/json", "{\"ok\":0,\"err\":\"busy\"}"); return;
  }
  JsonDocument stats = loadJsonFile("/stats.json");
  if (stats[id].isNull()) {
    stats[id]["totalDetik"] = 0;
    stats[id]["totalSesi"]  = 0;
  }
  stats[id]["totalDetik"] = stats[id]["totalDetik"].as<int>() + detik;
  if (sesi != 0) {
    // Hanya increment sesi kalau bukan STOP manual
    stats[id]["totalSesi"] = stats[id]["totalSesi"].as<int>() + 1;
  }
  saveJsonFile("/stats.json", stats);
  xSemaphoreGive(statsMutex);
  server.send(200, "application/json", "{\"ok\":1}");
}

// POST /api/stats/reset
void handleResetStats() {
  addCorsHeaders();
  if (!authCheck(true)) { server.send(401); return; } // SA only
  if (!server.hasArg("plain")) { server.send(400); return; }
  JsonDocument doc; deserializeJson(doc, server.arg("plain"));
  String id = doc["id"].as<String>();
  if (id == "" || id == "null") { server.send(400, "application/json", "{\"ok\":0}"); return; }

  if (xSemaphoreTake(statsMutex, STATS_MUTEX_TIMEOUT_TICKS) != pdTRUE) {
    server.send(503, "application/json", "{\"ok\":0,\"err\":\"busy\"}"); return;
  }
  JsonDocument stats = loadJsonFile("/stats.json");
  if (stats[id].isNull()) {
    stats[id]["totalDetik"] = 0;
    stats[id]["totalSesi"]  = 0;
  } else {
    stats[id]["totalDetik"] = 0;
    stats[id]["totalSesi"]  = 0; // Clear session count too
  }
  saveJsonFile("/stats.json", stats);
  xSemaphoreGive(statsMutex);
  server.send(200, "application/json", "{\"ok\":1}");
}

// POST /api/sync-time
// Body: {"date": "YYYY-MM-DD"}
void handleSyncTime() {
  addCorsHeaders();
  if (!authCheck(false)) { server.send(401); return; } // SA or Karyawan who is logged in
  if (!server.hasArg("plain")) { server.send(400); return; }
  JsonDocument doc;
  if (deserializeJson(doc, server.arg("plain"))) {
    server.send(400, "application/json", "{\"ok\":0}");
    return;
  }
  
  String clientDate = doc["date"] | "";
  if (clientDate == "" || clientDate.length() > 16) {
    server.send(400, "application/json", "{\"ok\":0,\"error\":\"Invalid Date\"}");
    return;
  }

  preferences.begin("registry", false);
  String lastDate = preferences.getString("lastDate", "");
  
  bool dateChanged = false;
  if (lastDate != "" && lastDate != clientDate) {
    dateChanged = true;
  }

  // Save the new date to Preferences
  preferences.putString("lastDate", clientDate);
  preferences.end();

  if (dateChanged) {
    Serial.printf("[DATE] Date changed from %s to %s. Resetting totalSesi for all units...\n", lastDate.c_str(), clientDate.c_str());
    if (xSemaphoreTake(statsMutex, STATS_MUTEX_TIMEOUT_TICKS) == pdTRUE) {
      JsonDocument stats = loadJsonFile("/stats.json");
      JsonObject rootObj = stats.as<JsonObject>();
      for (JsonPair kv : rootObj) {
        stats[kv.key()]["totalSesi"] = 0;
      }
      saveJsonFile("/stats.json", stats);
      xSemaphoreGive(statsMutex);
    }
  }

