trefeon/excavator-rental-timer/firmware/wifi_master_esp32_WEBUI/main.cpp
  server.send(200, "application/json", "{\"ok\":1,\"dateChanged\":" + String(dateChanged ? "true" : "false") + "}");
}

void handleGetTransaksi() {
  addCorsHeaders();
  if (!authCheck(false)) { server.send(401); return; }

  File file = SPIFFS.open("/transaksi.json", "r");
  if (!file || file.size() == 0) {
    if (file) file.close();
    server.send(200, "application/json", "[]");
    return;
  }
  server.streamFile(file, "application/json");
  file.close();
}

// ── POST /api/transaksi/add ────────────────────────────────────────
// Tambah 1 transaksi, auto-hapus yang lebih dari 7 hari, max 300 record
void handleAddTransaksi() {
  addCorsHeaders();
  if (!authCheck(false)) { server.send(401); return; }
  if (!server.hasArg("plain")) { server.send(400); return; }

  // Cek heap tersedia sebelum alokasi besar
  if (ESP.getFreeHeap() < 80000) {
    Serial.printf("[TRX] Low heap (%lu), skip write\n", (unsigned long)ESP.getFreeHeap());
    server.send(503, "application/json", "{\"ok\":0,\"code\":\"LOW_HEAP\"}");
    return;
  }

  JsonDocument reqDoc;
  if (deserializeJson(reqDoc, server.arg("plain"))) {
    server.send(400, "application/json", "{\"ok\":0}");
    return;
  }

  // Validasi field wajib
  if (reqDoc["rcId"].isNull() || reqDoc["ts"].isNull()) {
    server.send(400, "application/json", "{\"ok\":0,\"code\":\"MISSING_FIELD\"}");
    return;
  }

  // Ambil timestamp transaksi baru (ms, dari browser Date.now())
  // Gunakan double untuk menampung nilai 13-digit tanpa overflow
  double newTs = reqDoc["ts"].as<double>();

  // Batas 7 hari ke belakang (dalam ms)
  double cutoffMs = newTs - (7.0 * 24.0 * 3600.0 * 1000.0);

  // Load transaksi yang ada
  JsonDocument trxDoc;
  File fileR = SPIFFS.open("/transaksi.json", "r");
  if (fileR && fileR.size() > 0) {
    DeserializationError err = deserializeJson(trxDoc, fileR);
    fileR.close();
    if (err || !trxDoc.is<JsonArray>()) {
      trxDoc.to<JsonArray>(); // reset kalau corrupt
    }
  } else {
    if (fileR) fileR.close();
    trxDoc.to<JsonArray>();
  }

  JsonArray arr = trxDoc.as<JsonArray>();

  // ── Hapus transaksi yang lebih tua dari 7 hari ────────────────────
  // Iterasi dari belakang supaya remove() aman
  for (int i = (int)arr.size() - 1; i >= 0; i--) {
    double ts = arr[i]["ts"].as<double>();
    if (ts < cutoffMs) {
      arr.remove(i);
    }
  }

  // ── Batasi maks 300 record (safety cap untuk 10 RC + retensi 7 hari) ─
  // Hapus yang paling lama (index 0) kalau melebihi
  while (arr.size() >= 300) {
    arr.remove(0);
  }

  // ── Tambah transaksi baru di akhir ───────────────────────────────
  // BUGFIX: validate input ranges to prevent SPIFFS corruption and absurd
  // reports. rcId must be 1..50 (matches registry cap), menit 1..480, harga
  // 0..10_000_000. rcNama and pelanggan are bounded to 64 chars to keep the
  // JSON file small (each char is ~1 byte in serialized form).
  int rcId = reqDoc["rcId"].as<int>();
  int menit = reqDoc["menit"].as<int>();
  long harga = reqDoc["harga"].as<long>();
  if (rcId < 1 || rcId > 50) {
    server.send(400, "application/json", "{\"ok\":0,\"code\":\"BAD_RCID\"}");
    return;
  }
  if (menit < 1 || menit > 480) {
    server.send(400, "application/json", "{\"ok\":0,\"code\":\"BAD_MENIT\"}");
    return;
  }
  if (harga < 0 || harga > 10000000L) {
    server.send(400, "application/json", "{\"ok\":0,\"code\":\"BAD_HARGA\"}");
    return;
  }
  String rcNama = reqDoc["rcNama"].as<String>();
  String pelanggan = reqDoc["pelanggan"].as<String>();
  if (rcNama.length() > 64) rcNama = rcNama.substring(0, 64);
  if (pelanggan.length() > 64) pelanggan = pelanggan.substring(0, 64);

  JsonObject newTrx = arr.add<JsonObject>();
  newTrx["id"]        = reqDoc["id"];
  newTrx["rcId"]      = rcId;
  newTrx["rcNama"]    = rcNama;
  newTrx["pelanggan"] = pelanggan;
  newTrx["menit"]     = menit;
  newTrx["harga"]     = harga;
  newTrx["paket"]     = reqDoc["paket"].as<String>();
  newTrx["ts"]        = newTs; // simpan sebagai double

  // Simpan kembali ke SPIFFS
  File fileW = SPIFFS.open("/transaksi.json", "w");
  if (!fileW) {
    server.send(500, "application/json", "{\"ok\":0,\"code\":\"WRITE_FAIL\"}");
    return;
  }
  serializeJson(trxDoc, fileW);
  fileW.close();

  Serial.printf("[TRX] Saved. Total: %d records. Heap: %lu\n",
                (int)arr.size(), (unsigned long)ESP.getFreeHeap());

  server.send(200, "application/json", "{\"ok\":1}");
}

// GET /api/slaves — List all slave units (unchanged API)
void handleSlaves() {
  addCorsHeaders();

  JsonDocument doc;
  JsonArray array = doc.to<JsonArray>();
  uint32_t now = millis();

  if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
    for (int i = 0; i < slaveCount; i++) {
      JsonObject obj = array.add<JsonObject>();
      obj["id"] = slaves[i].id;
      obj["ip"] = slaves[i].ip;
      obj["mac"] = slaves[i].mac;
      obj["online"] = (now - slaves[i].lastSeen) < ONLINE_THRESHOLD_MS;
      obj["state"] = slaves[i].state;
      obj["time_left"] = slaves[i].time_left;
      obj["battery"] = slaves[i].battery;
    }
    xSemaphoreGive(slavesMutex);
  }

  String json;
  serializeJson(doc, json);
  server.send(200, "application/json", json);
}

// POST /api/command — Send command to slave via ESP-NOW (same API contract)
void handleCommandProxy() {
  addCorsHeaders();
  if (!authCheck(false)) { server.send(401); return; } // semua role yang login
  if (!server.hasArg("plain")) {
    server.send(400);
    return;
  }
  String body = server.arg("plain");

  JsonDocument doc;
  if (deserializeJson(doc, body)) {
    server.send(400, "application/json", "{\"ok\":0,\"error\":\"Invalid JSON\"}");
    return;
  }
  int targetId = doc["id"] | 0;
  String cmdStr = doc["cmd"] | "";
  int time = doc["time"] | 0;
  if (time < 0) time = 0;

  if (targetId <= 0 || cmdStr == "") {
    Serial.println("[PROXY] Command failed: Missing id or cmd");
    server.send(400, "application/json", "{\"ok\":0,\"error\":\"Missing id or cmd\"}");
    return;
  }

  cmdStr.toUpperCase();
  CmdType cmdEnum = cmdFromString(cmdStr.c_str());
  if (cmdEnum == CMD_NONE) {
    server.send(400, "application/json", "{\"ok\":0,\"error\":\"Unknown command\"}");
    return;
  }

  Serial.printf("[PROXY] Command '%s' (time: %d) for EXC-%02d\n", cmdStr.c_str(), time, targetId);
  netLedFlash(80);

  // Check slave exists
  bool found = false;
  int slaveIdx = -1;
  String targetMac = "";
  if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
    for (int i = 0; i < slaveCount; i++) {
      if (slaves[i].id == targetId) {
        found = true;
        slaveIdx = i;
        targetMac = slaves[i].mac;
        break;
      }
    }
    xSemaphoreGive(slavesMutex);
  }

