trefeon/excavator-rental-timer/firmware/wifi_master_esp32_WEBUI/main.cpp
  if (!found) {
    Serial.printf("[PROXY] Failed: Slave EXC-%02d not found in registry\n", targetId);
    server.send(404, "application/json", "{\"ok\":0,\"error\":\"Slave not found\"}");
    return;
  }

#if DEMO_MODE
  if (targetMac.startsWith("FF:FF:FF:00:00:") || targetMac.startsWith("EE:EE:EE:00:00:")) {
    if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
      if (cmdEnum == CMD_ADD_TIME) {
        // Sesi baru: reset sessionElapsed dan stoppedManually
        if (slaves[slaveIdx].state == "LOCKED" || slaves[slaveIdx].state == "ENDED") {
          slaves[slaveIdx].sessionElapsed  = 0;
          slaves[slaveIdx].stoppedManually = false;
          slaves[slaveIdx].state = "RUNNING";
        }
        slaves[slaveIdx].time_left += time;
      } else if (cmdEnum == CMD_PAUSE) {
        slaves[slaveIdx].state = "PAUSED";
      } else if (cmdEnum == CMD_RESUME) {
        if (slaves[slaveIdx].time_left > 0) {
          slaves[slaveIdx].state = "RUNNING";
        }
      } else if (cmdEnum == CMD_STOP) {
        // Simpan elapsed sebelum di-reset
        int elapsed = slaves[slaveIdx].sessionElapsed;
        int slaveId  = slaves[slaveIdx].id;
        slaves[slaveIdx].state = "ENDED";
        slaves[slaveIdx].time_left = 0;
        slaves[slaveIdx].sessionElapsed = 0;
        slaves[slaveIdx].stoppedManually = true; // tandai: jangan autoSave lagi saat ENDED terdeteksi polling
        char resp[128];
        snprintf(resp, sizeof(resp), "{\"ok\":1,\"code\":\"SUCCESS\",\"time_left\":0,\"state\":\"ENDED\"}");
        server.send(200, "application/json", String(resp));
        xSemaphoreGive(slavesMutex);
        saveElapsedOnly(slaveId, elapsed); // simpan totalDetik saja, TIDAK increment sesi
        return;
      }
      slaves[slaveIdx].lastSeen = millis();
      char resp[128];
      snprintf(resp, sizeof(resp), "{\"ok\":1,\"code\":\"SUCCESS\",\"time_left\":%d,\"state\":\"%s\"}", slaves[slaveIdx].time_left, slaves[slaveIdx].state.c_str());
      server.send(200, "application/json", String(resp));
      xSemaphoreGive(slavesMutex);
    } else {
      server.send(503, "application/json", "{\"ok\":0,\"error\":\"Mutex timeout\"}");
    }
    return;
  }
#endif

  // Build ESP-NOW command packet
  EspNowPacket pkt;
  memset(&pkt, 0, sizeof(pkt));
  pkt.type = PKT_COMMAND;
  pkt.targetId = targetId;
  pkt.senderId = 0; // Master
  pkt.cmd = cmdEnum;
  pkt.value = time;

  // Consume any stray semaphore gives
  xSemaphoreTake(cmdResponseSem, 0);

  // Reset response state
  portENTER_CRITICAL(&cmdResponseMux);
  cmdResponseReceived = false;
  portEXIT_CRITICAL(&cmdResponseMux);

  // Broadcast the command
  esp_err_t result = esp_now_send(ESPNOW_BROADCAST, (uint8_t*)&pkt, sizeof(pkt));
  if (result != ESP_OK) {
    Serial.printf("[PROXY] ESP-NOW send failed: %d\n", result);
    server.send(502, "application/json", "{\"ok\":0,\"error\":\"Radio send failed\"}");
    return;
  }

  // Wait for response from slave
  bool gotResponse = false;
  EspNowPacket respCopy;
  memset(&respCopy, 0, sizeof(respCopy));
  if (xSemaphoreTake(cmdResponseSem, pdMS_TO_TICKS(CMD_RESPONSE_TIMEOUT_MS)) == pdTRUE) {
    portENTER_CRITICAL(&cmdResponseMux);
    gotResponse = cmdResponseReceived;
    memcpy(&respCopy, &cmdResponsePkt, sizeof(respCopy)); // baca atomik bersama flag
    portEXIT_CRITICAL(&cmdResponseMux);
  }

  if (gotResponse && respCopy.senderId == (uint8_t)targetId) {
    // Build JSON response matching the API spec exactly.
    RespCode actualCode = (RespCode)respCopy.respCode;
    int ok = (actualCode == RESP_OK || actualCode == RESP_REBOOTING) ? 1 : 0;

    // Jika STOP berhasil: flush sisa elapsed (residual) yang BELUM tersimpan oleh
    // periodic save, lalu tandai stoppedManually agar heartbeat ENDED berikutnya
    // tidak menyimpan lagi. Browser TIDAK lagi mengirim elapsed (mencegah
    // double-count totalDetik), jadi residual ini ditangani sepenuhnya di sini.
    if (ok && cmdEnum == CMD_STOP) {
      int residual = 0, sid = 0;
      if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
        for (int i = 0; i < slaveCount; i++) {
          if (slaves[i].id == targetId) {
            residual = slaves[i].sessionElapsed;
            sid      = slaves[i].id;
            slaves[i].sessionElapsed  = 0;
            slaves[i].stoppedManually = true;
            break;
          }
        }
        xSemaphoreGive(slavesMutex);
      }
      if (residual > 0) saveElapsedOnly(sid, residual); // hanya residual, tidak double
    }

    char resp[160];
    snprintf(resp, sizeof(resp),
             "{\"ok\":%d,\"code\":\"%s\",\"time_left\":%lu,\"state\":\"%s\"}",
             ok,
             respCodeName(respCopy.respCode),
             (unsigned long)respCopy.timeLeft,
             pktStateName(respCopy.state));
    Serial.printf("[PROXY] Slave responded: %s\n", resp);
    server.send(200, "application/json", String(resp));
  } else if (gotResponse && respCopy.senderId != (uint8_t)targetId) {
    // A different slave replied (stale response, or a slave with a wrong
    // target ID). Don't claim success — the targeted slave didn't ack.
    Serial.printf("[PROXY] Stale ESP-NOW response: senderId=%d != targetId=%d\n",
                  respCopy.senderId, targetId);
    server.send(502, "application/json", "{\"ok\":0,\"error\":\"Stale slave response\"}");
  } else {
    Serial.printf("[PROXY] Slave EXC-%02d timeout (no ESP-NOW response)\n", targetId);
    server.send(502, "application/json", "{\"ok\":0,\"error\":\"Slave offline/timeout\"}");
  }
}

// POST /api/edit_slave — Change slave ID (unchanged logic)
void handleEditSlave() {
  addCorsHeaders();
  if (!authCheck(true)) { server.send(401); return; } // SA only
  if (!server.hasArg("plain")) {
    server.send(400);
    return;
  }
  String body = server.arg("plain");

  JsonDocument doc;
  if (deserializeJson(doc, body)) {
    server.send(400, "application/json", "{\"ok\":0}");
    return;
  }
  String mac = doc["mac"] | "";
  int newId = doc["id"] | 0;

  if (mac == "" || !isValidMac(mac) || newId <= 0) {
    Serial.println("[MANAGE] Edit ID failed: Invalid MAC or ID");
    server.send(400, "application/json", "{\"ok\":0}");
    return;
  }

